PA4WD/mbed-os/connectivity/drivers/emac/TARGET_STM/stm32xx_emac_v3.cpp
/* Copyright (c) 2017-2019 ARM Limited
 * Copyright (c) 2017-2019 STMicroelectronics
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

#if DEVICE_EMAC
#ifdef ETH_IP_VERSION_V3

#include <stdlib.h>

#include "cmsis_os.h"

#include "mbed_interface.h"
#include "mbed_assert.h"
#include "events/mbed_shared_queues.h"
#include "netsocket/nsapi_types.h"
#include "platform/mbed_power_mgmt.h"
#include "platform/mbed_error.h"

#include "stm32xx_emac_config.h"
#include "stm32xx_emac.h"

#include "mbed-trace/mbed_trace.h"

#include "lan8742/lan8742.h"
#include "lwip/memp.h"
#include "lwip/api.h"

#include "rtos/Semaphore.h"

#include "Semaphore.h"

#define TRACE_GROUP "STE3"

/* mbed trace feature is supported */
/* ex in mbed_app.json */
/*   "mbed-trace.enable": "1" */

/* mbed_trace: debug traces (tr_debug) can be disabled here with no change in mbed_app.json */
// #undef TRACE_LEVEL_DEBUG
// #define TRACE_LEVEL_DEBUG 0

/* To get trace from every packet, enable deep trace macro */
// #define STM32xx_DEEP_TRACE
#ifdef STM32xx_DEEP_TRACE
#define tr_debug_deep(...) tr_debug(__VA_ARGS__)
#else
#define tr_debug_deep(...)
#endif

using namespace std::chrono;

/* \brief Flags for worker thread */
#define FLAG_RX                 1
#define FLAG_CONNECTED          2

/** \brief  Driver thread priority */
#define THREAD_PRIORITY         (osPriorityHigh)

//#define PHY_TASK_PERIOD      200ms
#define PHY_TASK_PERIOD      500ms

#define ETH_RX_BUFFER_SIZE            1000U

#define STM_HWADDR_SIZE         (6)
#define STM_ETH_MTU_SIZE        1500
#define STM_ETH_IF_NAME         "st"

//#define ETH_MAX_PACKET_SIZE     1524

// typedef struct
// {
//   struct pbuf_custom pbuf_custom;
//   uint8_t buff[(ETH_MAX_PACKET_SIZE + 31) & ~31] __ALIGNED(32);
// } RxBuff_t;

// typedef enum
// {
//   RX_ALLOC_OK       = 0x00,
//   RX_ALLOC_ERROR    = 0x01
// } RxAllocStatusTypeDef;/* Variable Definitions */
// static uint8_t RxAllocStatus;

//ETH_DMADescTypeDef DMARxDscrTab[ETH_RX_DESC_CNT] __attribute__((section(".RxDecripSection"))); /* Ethernet Rx DMA Descriptors */
ETH_DMADescTypeDef DMARxDscrTab[ETH_RX_DESC_CNT] __attribute__(( section(".RxDecripSection"), aligned(32)));/* Ethernet Rx DMA Descriptor */

//ETH_DMADescTypeDef DMATxDscrTab[ETH_TX_DESC_CNT] __attribute__((section(".TxDecripSection")));   /* Ethernet Tx DMA Descriptors */
ETH_DMADescTypeDef DMATxDscrTab[ETH_TX_DESC_CNT] __attribute__((section(".TxDecripSection"), aligned(32)));/* Ethernet Tx DMA Descriptor */

//uint32_t Rx_Buff_Idx;
//uint8_t DMARxBuffer[ETH_RX_DESC_CNT][ETH_MAX_PACKET_SIZE] __attribute__((section(".RxArraySection"))); /* Ethernet Receive Buffers */
//uint8_t DMARxBuffer[ETH_RX_DESC_CNT][ETH_MAX_PACKET_SIZE] __attribute__((section(".emac_section"), aligned(32))); /* Ethernet Receive Buffer */
uint8_t DMARxBuffer[ETH_RX_DESC_CNT][ETH_RX_BUFFER_SIZE] __attribute__((section(".emac_section"), aligned(32))); /* Ethernet Receive Buffer */



//uint8_t Tx_Buff[ETH_TX_DESC_CNT][ETH_MAX_PACKET_SIZE] __attribute__((section(".TxArraySection"))); /* Ethernet Transmit Buffers */

//MBED_ASSERT(ETH_MAX_PACKET_SIZE % 4 == 0, "Rx buffer size must be a multiple of 4");

// typedef struct my_custom_pbuf
// {
//    struct pbuf_custom p;
//    //void* dma_descriptor;
//    uint8_t buff[(ETH_MAX_PACKET_SIZE + 31) & ~31] __ALIGNED(32);
// } my_custom_pbuf_t;

/* Memory Pool Declaration */
//LWIP_MEMPOOL_DECLARE(RX_POOL, ETH_RX_DESC_CNT, sizeof(my_custom_pbuf_t), "Zero-copy RX PBUF pool");

//osSemaphoreId RxPktSemaphore = NULL;   /* Semaphore to signal incoming packets */
//osSemaphoreId TxPktSemaphore = NULL;   /* Semaphore to signal transmit packet complete */
//osSemaphoreId TxPktSemaphore = osSemaphoreNew(1, 1, NULL);;   /* Semaphore to signal transmit packet complete */
rtos::Semaphore TxPktSemaphore(1);


static lan8742_Object_t LAN8742;

static int32_t ETH_PHY_IO_Init(void);
static int32_t ETH_PHY_IO_DeInit(void);
static int32_t ETH_PHY_IO_ReadReg(uint32_t DevAddr, uint32_t RegAddr, uint32_t *pRegVal);
static int32_t ETH_PHY_IO_WriteReg(uint32_t DevAddr, uint32_t RegAddr, uint32_t RegVal);
static int32_t ETH_PHY_IO_GetTick(void);

static lan8742_IOCtx_t LAN8742_IOCtx = {
    ETH_PHY_IO_Init,
    ETH_PHY_IO_DeInit,
    ETH_PHY_IO_WriteReg,
    ETH_PHY_IO_ReadReg,
    ETH_PHY_IO_GetTick
};

static ETH_TxPacketConfig TxConfig;

volatile bool IsConnected = false;

MBED_WEAK uint8_t mbed_otp_mac_address(char *mac);
void mbed_default_mac_address(char *mac);

#ifdef __cplusplus
extern "C" {
#endif

void _eth_config_mac(ETH_HandleTypeDef *heth);
//void ETH_IRQHandler(void);
//MBED_WEAK void STM_HAL_ETH_Handler(ETH_HandleTypeDef *heth);

#ifdef __cplusplus
}
#endif

static void MPU_Config(void)
{
    MPU_Region_InitTypeDef MPU_InitStruct;

    /* Disable the MPU */
    HAL_MPU_Disable();

    /* Configure the MPU attributes as Device not cacheable for ETH DMA descriptors */
    MPU_InitStruct.Enable = MPU_REGION_ENABLE;
    MPU_InitStruct.BaseAddress = 0x30040000;
    MPU_InitStruct.Size = MPU_REGION_SIZE_1KB;
    MPU_InitStruct.AccessPermission = MPU_REGION_FULL_ACCESS;
    MPU_InitStruct.IsBufferable = MPU_ACCESS_BUFFERABLE;
    MPU_InitStruct.IsCacheable = MPU_ACCESS_NOT_CACHEABLE;
    MPU_InitStruct.IsShareable = MPU_ACCESS_NOT_SHAREABLE;
    MPU_InitStruct.Number = MPU_REGION_NUMBER0;
    MPU_InitStruct.TypeExtField = MPU_TEX_LEVEL0;
    MPU_InitStruct.SubRegionDisable = 0x00;
    MPU_InitStruct.DisableExec = MPU_INSTRUCTION_ACCESS_ENABLE;
    HAL_MPU_ConfigRegion(&MPU_InitStruct);

    // MPU_InitStruct.Enable = MPU_REGION_ENABLE;
    // MPU_InitStruct.BaseAddress = 0x30040400;
    // MPU_InitStruct.Size = MPU_REGION_SIZE_16KB;
    // MPU_InitStruct.AccessPermission = MPU_REGION_FULL_ACCESS;
    // MPU_InitStruct.IsBufferable = MPU_ACCESS_NOT_BUFFERABLE;
    // MPU_InitStruct.IsCacheable = MPU_ACCESS_CACHEABLE;
    // MPU_InitStruct.IsShareable = MPU_ACCESS_NOT_SHAREABLE;
    // MPU_InitStruct.Number = MPU_REGION_NUMBER1;
    // MPU_InitStruct.TypeExtField = MPU_TEX_LEVEL0;
    // MPU_InitStruct.SubRegionDisable = 0x00;
    // MPU_InitStruct.DisableExec = MPU_INSTRUCTION_ACCESS_ENABLE;
    // HAL_MPU_ConfigRegion(&MPU_InitStruct);

    /* Configure the MPU attributes as Cacheable write through
       for LwIP RAM heap which contains the Tx buffers */
    MPU_InitStruct.Enable = MPU_REGION_ENABLE;
    MPU_InitStruct.BaseAddress = 0x30044000;
    MPU_InitStruct.Size = MPU_REGION_SIZE_16KB;
    MPU_InitStruct.AccessPermission = MPU_REGION_FULL_ACCESS;
    MPU_InitStruct.IsBufferable = MPU_ACCESS_NOT_BUFFERABLE;
    MPU_InitStruct.IsCacheable = MPU_ACCESS_CACHEABLE;
    MPU_InitStruct.IsShareable = MPU_ACCESS_NOT_SHAREABLE;
    MPU_InitStruct.Number = MPU_REGION_NUMBER1;
    MPU_InitStruct.TypeExtField = MPU_TEX_LEVEL0;
    MPU_InitStruct.SubRegionDisable = 0x00;
    MPU_InitStruct.DisableExec = MPU_INSTRUCTION_ACCESS_ENABLE;
    HAL_MPU_ConfigRegion(&MPU_InitStruct);

    /* Enable the MPU */
    HAL_MPU_Enable(MPU_PRIVILEGED_DEFAULT);
}


/**
 * IRQ Handler
 *
 * @param  heth: ETH handle
 * @retval None
 */
// MBED_WEAK void STM_HAL_ETH_Handler()
// {
// }
void STM_HAL_ETH_Handler()
{
   STM32_EMAC &emac = STM32_EMAC::get_instance();
   HAL_ETH_IRQHandler(&emac.EthHandle);
}

/**
 * Ethernet IRQ Handler
 *
 * @param  None
 * @retval None
 */
// void ETH_IRQHandler(void)
// {
//     STM_HAL_ETH_Handler();
// }

STM32_EMAC::STM32_EMAC()
    : thread(0)
    , phy_status(0)
{
}

static osThreadId_t create_new_thread(const char *threadName, void (*thread)(void *arg), void *arg, int stacksize, osPriority_t priority, mbed_rtos_storage_thread_t *thread_cb)
{
    tr_info("create_new_thread %s stack:%d", threadName, stacksize);
    
    osThreadAttr_t attr = {0};
    attr.name = threadName;
    attr.stack_mem  = malloc(stacksize);
    attr.cb_mem  = thread_cb;
    attr.stack_size = stacksize;
    attr.cb_size = sizeof(mbed_rtos_storage_thread_t);
    attr.priority = priority;
    return osThreadNew(thread, arg, &attr);
}

/**
 * In this function, the hardware should be initialized.
 */
bool STM32_EMAC::low_level_init_successful()
{
    MPU_Config();

    /* Init ETH */
    EthHandle.Instance = ETH;

    uint8_t MACAddr[6];
    mbed_mac_address((char *)MACAddr);
    EthHandle.Init.MACAddr = &MACAddr[0];

    EthHandle.Init.MediaInterface = HAL_ETH_RMII_MODE;
    EthHandle.Init.RxDesc = DMARxDscrTab;
    EthHandle.Init.TxDesc = DMATxDscrTab;
    //EthHandle.Init.RxBuffLen = ETH_MAX_PACKET_SIZE;
    //EthHandle.Init.RxBuffLen = 1524;
    EthHandle.Init.RxBuffLen = 1536;

    tr_info("MAC Addr %02x:%02x:%02x:%02x:%02x:%02x", MACAddr[0], MACAddr[1], MACAddr[2], MACAddr[3], MACAddr[4], MACAddr[5]);
    tr_info("ETH buffers Rx:%u size:%u Tx:%u size:%u - rxbuffer:%u", ETH_RX_DESC_CNT, sizeof(DMARxDscrTab), ETH_TX_DESC_CNT, sizeof(DMATxDscrTab), sizeof(DMARxBuffer));

    //NVIC_SetVector(ETH_IRQn, (uint32_t)&HAL_ETH_IRQHandler);
    NVIC_SetVector(ETH_IRQn, (uint32_t)&STM_HAL_ETH_Handler);

    //HAL_ETH_RegisterRxAllocateCallback(&EthHandle, HAL_ETH_RxAllocateCallback);
    //HAL_ETH_RegisterRxLinkCallback(&EthHandle, HAL_ETH_RxLinkCallback);

