PA4WD/mbed-os/connectivity/drivers/emac/TARGET_STM/stm32xx_emac_v3.cpp
    //HAL_ETH_RegisterTxFreeCallback(&EthHandle, HAL_ETH_RxLinkCallback);

    /* create a binary semaphore used for informing ethernetif of frame reception */
    //RxPktSemaphore = osSemaphoreNew(1, 1, NULL);
    /* create a binary semaphore used for informing ethernetif of frame transmission */
    //TxPktSemaphore = osSemaphoreNew(1, 1, NULL);


    // for (idx = 0; idx < ETH_RX_DESC_CNT; idx++) {
    //     HAL_ETH_DescAssignMemory(&EthHandle, idx, Rx_Buff[idx], NULL);
    // }




    /* Set PHY IO functions */
    LAN8742_RegisterBusIO(&LAN8742, &LAN8742_IOCtx);
    /* Initialize the LAN8742 ETH PHY */
    if(LAN8742_Init(&LAN8742) != LAN8742_STATUS_OK)
    {
        tr_error("LAN8742_Init failed");
        return false;
    }

    if (HAL_ETH_Init(&EthHandle) != HAL_OK) 
    {
        tr_error("HAL_ETH_Init failed");
        return false;
    }

    // Enable timestamping of RX packets. We enable all packets to be timestamped to cover both IEEE 1588 and gPTP.
    //EthHandle.Instance->MACTSCR |= ETH_MACTSCR_TSENALL;

    memset(&TxConfig, 0, sizeof(ETH_TxPacketConfig));
    TxConfig.Attributes = ETH_TX_PACKETS_FEATURES_CSUM | ETH_TX_PACKETS_FEATURES_CRCPAD;
    TxConfig.ChecksumCtrl = ETH_CHECKSUM_IPHDR_PAYLOAD_INSERT_PHDR_CALC;
    //TxConfig.ChecksumCtrl = ETH_CHECKSUM_DISABLE;
    TxConfig.CRCPadCtrl = ETH_CRC_PAD_INSERT;

    tr_info("low_level_init_successful");
    return true;
}


const char *getMACError(ETH_HandleTypeDef *heth)
{
    uint32_t mac_error = HAL_ETH_GetMACError(heth);
    if (mac_error & ETH_RECEIVE_WATCHDOG_TIMEOUT)
        return "ETH_RECEIVE_WATCHDOG_TIMEOUT";
    else if (mac_error & ETH_EXECESSIVE_COLLISIONS)
        return "ETH_EXECESSIVE_COLLISIONS";
    else if (mac_error & ETH_LATE_COLLISIONS)
        return "ETH_LATE_COLLISIONS";
    else if (mac_error & ETH_EXECESSIVE_DEFERRAL)
        return "ETH_EXECESSIVE_DEFERRAL";
    else if (mac_error & ETH_TRANSMIT_JABBR_TIMEOUT)
        return "ETH_TRANSMIT_JABBR_TIMEOUT";
    else if (mac_error & ETH_LOSS_OF_CARRIER)
        return "ETH_LOSS_OF_CARRIER";
    else if (mac_error & ETH_NO_CARRIER)
        return "ETH_NO_CARRIER";
    return "?????";
}

//--------------------- TX ---------------------------


/**
 * This function should do the actual transmission of the packet. The packet is
 * contained in the memory buffer chain that is passed to the function.
 *
 * @param buf the MAC packet to send (e.g. IP packet including MAC addresses and type)
 * @return true if the packet could be sent
 *         false value if the packet couldn't be sent
 *
 * @note Returning ERR_MEM here if a DMA queue of your MAC is full can lead to
 *       strange results. You might consider waiting for space in the DMA queue
 *       to become availale since the stack doesn't retry to send a packet
 *       dropped because of memory failure (except for the TCP timers).
 */
bool STM32_EMAC::link_out(emac_mem_buf_t *buf)
{
    tr_info("link_out");
     
    bool success = false;
    ETH_BufferTypeDef Txbuffer[ETH_TX_DESC_CNT];
    HAL_StatusTypeDef status;

    struct pbuf *p = (struct pbuf *)buf;

    printf("buf %lu\r\n", buf);
    printf("p   %lu\r\n", p);

    /* Get exclusive access */
    TXLockMutex.lock();

    memset(Txbuffer, 0, ETH_TX_DESC_CNT * sizeof(ETH_BufferTypeDef));

    uint32_t i = 0;
    struct pbuf *q = NULL;
    /* copy frame from pbufs to driver buffers */
    for (q = p; q != NULL; q = q->next) 
    {
        if (i >= ETH_TX_DESC_CNT) 
        {
            tr_error("Error : ETH_TX_DESC_CNT not sufficient");
            //goto error;
            return false;
        }

        Txbuffer[i].buffer = (uint8_t *)q->payload;
        Txbuffer[i].len = q->len;

        if (i > 0) 
        {
            Txbuffer[i - 1].next = &Txbuffer[i];
        }
        if (q->next == NULL) 
        {
            Txbuffer[i].next = NULL;
        }
        i++;
    }

    //printf("frameLength:%lu tot_len:%lu\r\n", frameLength, p->tot_len);
    printf("tot_len:%u\r\n", p->tot_len);
    printf("ref:%u\r\n", p->ref);

    TxConfig.Length = p->tot_len;
    TxConfig.TxBuffer = Txbuffer;
    TxConfig.pData = p;

    //TxConfig.PayloadLen
    //pbuf_ref(p);

    //tr_info("send %lu", frameLength);

    // status = HAL_ETH_Transmit(&EthHandle, &TxConfig, 50);
    // if (status == HAL_OK) 
    // {
    //     success = true;
    // } 
    // else 
    // {
    //     tr_error("Error returned by HAL_ETH_Transmit (%d)", status);
    //     if (HAL_ETH_GetState(&EthHandle) == HAL_ETH_STATE_ERROR) {
    //         tr_error("ETH error (%lx)", HAL_ETH_GetError(&EthHandle));
	// 	}
    //     if (HAL_ETH_GetDMAError(&EthHandle)) {
    //         tr_error("DMA error (%lx)", HAL_ETH_GetDMAError(&EthHandle));
	// 	}
    //     if (HAL_ETH_GetMACError(&EthHandle)) {
    //         tr_error("MAC error (%lx) %s", HAL_ETH_GetMACError(&EthHandle), getMACError(&EthHandle));
	// 	}
    //     success = false;
    // }
    //----------------------

    //pbuf_ref(p);

    printf("transmit\r\n");

    err_t errval = ERR_OK;
    do
    {
        if(HAL_ETH_Transmit_IT(&EthHandle, &TxConfig) == HAL_OK)
        {
            errval = ERR_OK;
            success = true;
        }
        else
        {
            if(HAL_ETH_GetError(&EthHandle) & HAL_ETH_ERROR_BUSY)
            {
                printf("waiting for tx\r\n");
                /* Wait for descriptors to become available */
                TxPktSemaphore.try_acquire_for(500ms);
                HAL_ETH_ReleaseTxPacket(&EthHandle);
                errval = ERR_BUF;                
            }
            else
            {
                /* Other error */
                pbuf_free(p);
                errval =  ERR_IF;                
            }
        }
    }while(errval == ERR_BUF);

    printf("send done\r\n");

    /* Restore access */
    TXLockMutex.unlock();
    return success;


//     status = HAL_ETH_Transmit_IT(&EthHandle, &TxConfig);
//     printf("status %lu\r\n", status);

//     if (status == HAL_OK) 
//     {
//         success = true;
//     } 
//     else 
//     {
//         tr_error("Error returned by HAL_ETH_Transmit_IT (%d)", status);
//         if (HAL_ETH_GetState(&EthHandle) == HAL_ETH_STATE_ERROR) {
//             tr_error("ETH error (%x)", HAL_ETH_GetError(&EthHandle));
// 		}
//         if (HAL_ETH_GetDMAError(&EthHandle)) {
//             tr_error("DMA error (%x)", HAL_ETH_GetDMAError(&EthHandle));
// 		}
//         if (HAL_ETH_GetMACError(&EthHandle)) {
//             tr_error("MAC error (%x) %s", HAL_ETH_GetMACError(&EthHandle), getMACError(&EthHandle));
// 		}
//         success = false;
//     }
//     //TxPktSemaphore.try_acquire_for(500ms);
//     //osSemaphoreWait(TxPktSemaphore, osWaitForever);
//     // while(osSemaphoreWait(TxPktSemaphore, osWaitForever) != osOK)
//     // {
//     // }
//     tr_info("release");
//     HAL_ETH_ReleaseTxPacket(&EthHandle);

