PA4WD/mbed-os/connectivity/drivers/emac/TARGET_STM/stm32xx_emac_v3.cpp
// error:

//     if (p->ref > 1) {
//         pbuf_free(p);
//     }

//     /* Restore access */
//     TXLockMutex.unlock();

//     return success;
}

void HAL_ETH_TxCpltCallback(ETH_HandleTypeDef *heth_handle)
{
    //tr_info("HAL_ETH_TxCpltCallback");
    //osSemaphoreRelease(TxPktSemaphore);
    TxPktSemaphore.release();
}

void HAL_ETH_TxFreeCallback(uint32_t * buff)
{
    tr_info("HAL_ETH_TxFreeCallback");
    pbuf_free((struct pbuf *)buff);
}


//--------------------- RX ---------------------------


/**
  * @brief  Custom Rx pbuf free callback
  * @param  pbuf: pbuf to be freed
  * @retval None
  */
// void pbuf_free_custom(struct pbuf *p)
// {
//   struct pbuf_custom* custom_pbuf = (struct pbuf_custom*)p;
//   LWIP_MEMPOOL_FREE(RX_POOL, custom_pbuf);
//    /* If the Rx Buffer Pool was exhausted, signal the ethernetif_input task to
//    * call HAL_ETH_GetRxDataBuffer to rebuild the Rx descriptors. */
//   if (RxAllocStatus == RX_ALLOC_ERROR)
//   {
//     RxAllocStatus = RX_ALLOC_OK;
//   }
// }

struct eth_stm32_rx_buffer_header {
	struct eth_stm32_rx_buffer_header *next;
	uint16_t size;
	bool used;
    //uint8_t buff[(ETH_MAX_PACKET_SIZE + 31) & ~31] __ALIGNED(32);
};

// struct eth_stm32_tx_buffer_header {
// 	ETH_BufferTypeDef tx_buff;
// 	bool used;
// };

// struct eth_stm32_tx_context {
// 	struct net_pkt *pkt;
// 	uint16_t first_tx_buffer_index;
// };

// typedef struct my_custom_pbuf
// {
//    struct pbuf_custom p;
//    void* dma_descriptor;
// } my_custom_pbuf_t;



/* Memory Pool Declaration */
//LWIP_MEMPOOL_DECLARE(RX_POOL, ETH_RX_BUFFER_CNT, sizeof(RxBuff_t), "Zero-copy RX PBUF pool")
//LWIP_PBUF_MEMPOOL()


static struct eth_stm32_rx_buffer_header DMARxBufferHeader[ETH_RX_DESC_CNT];
//static struct eth_stm32_tx_buffer_header dma_tx_buffer_header[ETH_TX_DESC_CNT];

//ETH_BufferTypeDef RxBuff;

/**
  \brief       Rx Allocate callback.
  \param[in]   buff  pointer to allocated buffer
  \return      None
*/
void HAL_ETH_RxAllocateCallback(uint8_t **buff)
{
    //tr_info("HAL_ETH_RxAllocateCallback %u connected:%u", **buff, IsConnected);
    tr_info("HAL_ETH_RxAllocateCallback %u", **buff);

    //STM32_EMAC &emac = STM32_EMAC::get_instance();
    //emac.memory_manager->alloc_pool()


    for (size_t i = 0; i < ETH_RX_DESC_CNT; ++i)
    {        
		if (!DMARxBufferHeader[i].used)
        {
			DMARxBufferHeader[i].next = NULL;
			DMARxBufferHeader[i].size = 0;
			DMARxBufferHeader[i].used = true;
			*buff = DMARxBuffer[i];
            //*buff = DMARxBufferHeader[i].buff;
			return;
		}
	}
	*buff = NULL;



    // STM32_EMAC &emac = STM32_EMAC::get_instance();
    // for (size_t i = 0; i < ETH_RX_DESC_CNT; ++i)
    // {
    //     emac_mem_buf_t *p = emac.memory_manager->alloc_pool(ETH_MAX_PACKET_SIZE, i);
    //     if(p)
    //     {
    //         printf("ref %u\r\n", ((pbuf *)p)->ref);
    //         //((pbuf)p).ref
    //         //((pbuf)p).payload = DMARxBuffer[];

    //         *buff = (uint8_t *)p;
    //         //*buff = (uint8_t *)p + offsetof(emac_mem_buf_t, buff);
    //         //pbuf_alloc(PBUF_RAW, ETH_MAX_PACKET_SIZE,)
    //         return;
    //     }
	// }    
    // *buff = NULL;
    // printf("buff == null\r\n");


    // STM32_EMAC &emac = STM32_EMAC::get_instance();
    // emac_mem_buf_t *p = emac.memory_manager->alloc_pool(ETH_MAX_PACKET_SIZE, 0);
    // if(p)
    // {
    //     printf("ref %u\r\n", ((pbuf *)p)->ref);
    //     //((pbuf)p).ref
    //     //((pbuf)p).payload = DMARxBuffer[];

    //     *buff = (uint8_t *)p;
    //     //*buff = (uint8_t *)p + offsetof(emac_mem_buf_t, buff);
    //     //pbuf_alloc(PBUF_RAW, ETH_MAX_PACKET_SIZE,)
    // }
    // else 
    // {
    //     printf("buff == null\r\n");
    //     *buff = NULL;
    // }

    
}

/* Pointer to an array of ETH_MAX_PACKET_SIZE uint8_t's */
typedef uint8_t (*RxBufferPtr)[ETH_RX_BUFFER_SIZE];

/**
  \brief       Rx Link callback.
  \param[in]   pStart  pointer to packet start
  \param[in]   pStart  pointer to packet end
  \param[in]   buff    pointer to received data
  \param[in]   Length  received data length
  \return      None
*/
void HAL_ETH_RxLinkCallback(void **pStart, void **pEnd, uint8_t *buff, uint16_t Length)
{
    tr_info("HAL_ETH_RxLinkCallback buf:%d len:%d", *buff, Length);



    // //tr_info("HAL_ETH_RxLinkCallback start:%d end:%d buf:%d len:%d", (uint32_t)**pStart, (uint32_t)**pEnd, *buff, Length);
    // tr_info("HAL_ETH_RxLinkCallback buf:%d len:%d", *buff, Length);

    // /* buff points to the begin on one of the rx buffers,
	//  * so we can compute the index of the given buffer
	//  */
	// size_t index = (RxBufferPtr)buff - &DMARxBuffer[0];
    // tr_info("link index %d", index);

	// struct eth_stm32_rx_buffer_header *header = &DMARxBufferHeader[index];
    // tr_info("header size:%d next:%d used:%d", header->size, header->next, header->used);

    // MBED_ASSERT(index < ETH_RX_DESC_CNT);

	// header->size = Length;

	// if (!*pStart) {
	// 	/* first packet, set head pointer of linked list */
	// 	*pStart = header;
	// 	*pEnd = header;
	// } else {
    //     MBED_ASSERT(*pEnd != NULL);
	// 	/* not the first packet, add to list and adjust tail pointer */
	// 	((struct eth_stm32_rx_buffer_header *)*pEnd)->next = header;
	// 	*pEnd = header;
	// }
    // tr_info("header size:%d next:%d used:%d", header->size, header->next, header->used);
}

void HAL_ETH_RxCpltCallback(ETH_HandleTypeDef *heth)
{
	//tr_info("HAL_ETH_RxCpltCallback");
    //osSemaphoreRelease(RxPktSemaphore);
    // STM32_EMAC &emac = STM32_EMAC::get_instance();
    // if (emac.thread) {
    //     osThreadFlagsSet(emac.thread, FLAG_RX);
    // }
}

/**
 * Should allocate a contiguous memory buffer and transfer the bytes of the incoming
 * packet to the buffer.
 *
 * @param buf If a frame was received and the memory buffer allocation was successful, a memory
 *            buffer filled with the received packet (including MAC header)
 * @return negative value when no more frames,
 *         zero when frame is received
 */
// int STM32_EMAC::low_level_input(emac_mem_buf_t **buf)
// {
//     tr_info("low_level_input");

//     struct pbuf *p = NULL;

//     HAL_StatusTypeDef ret = HAL_ETH_ReadData(&EthHandle, (void **)&p);

//     //if(HAL_ETH_ReadData(&EthHandle, (void **)&p) == HAL_OK)
//     if(ret == HAL_OK)
//     {
//         tr_info("read len:%d next:%d", p->len, p->next);

//         *buf = pbuf_alloc(PBUF_RAW, p->len, PBUF_POOL);
//         if (*buf) {
//             pbuf_take((struct pbuf *)*buf, p->payload, p->len);
//         }
//     }
//     else
//     {
//         return -1;
//     }
//     return 0;


//     ETH_BufferTypeDef RxBuff;
//     uint32_t frameLength = 0;

//     if (HAL_ETH_GetRxDataBuffer(&EthHandle, &RxBuff) == HAL_OK) {
//         if (HAL_ETH_GetRxDataLength(&EthHandle, &frameLength) != HAL_OK) {
//             tr_error("Error: returned by HAL_ETH_GetRxDataLength");
//             return -1;
//         }

