PA4WD/mbed-os/connectivity/drivers/emac/TARGET_STM/stm32xx_emac_v3.cpp
//         /* Build Rx descriptor to be ready for next data reception */
//         HAL_ETH_BuildRxDescriptors(&EthHandle);

// #if !(defined(DUAL_CORE) && defined(CORE_CM4))
//         /* Invalidate data cache for ETH Rx Buffers */
//         SCB_InvalidateDCache_by_Addr((uint32_t *)RxBuff.buffer, frameLength);
// #endif

//         *buf = pbuf_alloc(PBUF_RAW, frameLength, PBUF_POOL);
//         if (*buf) {
//             pbuf_take((struct pbuf *)*buf, RxBuff.buffer, frameLength);
//         }


//     } else {
//         return -1;
//     }

//     return 0;
//}

/** \brief  Attempt to read a packet from the EMAC interface.
 *
 */
// void STM32_EMAC::packet_rx()
// {
//     /* move received packet into a new buf */
//     //while (1) {
//         emac_mem_buf_t *p = NULL;
//         RXLockMutex.lock();
//         if (low_level_input(&p) < 0) 
//         {
//             RXLockMutex.unlock();
//             //break;
//         }
//         if (p) 
//         {
//             emac_link_input_cb(p);
//         }
//         RXLockMutex.unlock();
//     //}
// }

/** \brief  Worker thread.
 *
 * Woken by thread flags to receive packets or clean up transmit
 *
 *  \param[in] pvParameters pointer to the interface data
 */
void STM32_EMAC::thread_function(void *pvParameters)
{
    tr_info("thread_function");

    static struct STM32_EMAC *stm32_enet = static_cast<STM32_EMAC *>(pvParameters);
    while (1)
    {
        //printf(".");
        if(IsConnected)
        {        
        //uint32_t flags = osThreadFlagsWait(FLAG_CONNECTED, osFlagsWaitAny, osWaitForever);
        //if (flags & FLAG_CONNECTED)
        //{ 
            //osThreadFlagsClear(FLAG_CONNECTED);
        struct pbuf *pb = NULL;
        HAL_StatusTypeDef ret = HAL_ETH_ReadData(&stm32_enet->EthHandle, (void **)&pb);

        //tr_info("ret:%d error:%d state:0x%x", ret, stm32_enet->EthHandle.ErrorCode, stm32_enet->EthHandle.gState);

        //if(HAL_ETH_ReadData(&stm32_enet->EthHandle, (void **)&pb) == HAL_OK)
        if(ret == HAL_OK)
        {
            tr_info("read len:%d next:%d", pb->len, pb->next);

                    // emac_mem_buf_t *buf = NULL;
                    // buf = pbuf_alloc(PBUF_RAW, pb->len, PBUF_POOL);
                    // if (buf) 
                    // {
                    //     pbuf_take((struct pbuf *)buf, pb->payload, pb->len);
                    //     stm32_enet->emac_link_input_cb(buf);
                    // }
        }
        //}
        }
        else
        {
            osDelay(1000);
            printf(".");
        }

        // tr_info("wait for flag");
        // uint32_t flags = osThreadFlagsWait(FLAG_RX, osFlagsWaitAny, osWaitForever);

        // if (flags & FLAG_RX)
        // {            
        //     tr_info("FLAG_RX");
        //     //stm32_enet->packet_rx();
        //     //if(IsConnected)
        //     //{
        //         emac_mem_buf_t *buf = NULL;
        //         // if (stm32_enet->low_level_input(&p) == 0) 
        //         // {
        //         //     //RXLockMutex.unlock();
        //         //     //break;
        //         //     stm32_enet->emac_link_input_cb(p);
        //         // }
        //         // if (p) 
        //         // {
        //         //     emac_link_input_cb(p);
        //         // }


        //         //stm32_enet->EthHandle

                
                
                
        //         //dmarxdesc = (ETH_DMADescTypeDef *)heth->RxDescList.RxDesc[descidx];
  
        //         tr_info("RxDescIdx %d", stm32_enet->EthHandle.RxDescList.RxDescIdx);
        //         //tr_info("RxBuildDescCnt val %d", stm32_enet->EthHandle.RxDescList.RxBuildDescCnt);
        //         //tr_info("RxBuildDescCnt - %d", (ETH_RX_DESC_CNT - stm32_enet->EthHandle.RxDescList.RxBuildDescCnt));
        //         tr_info("RxBuildDescCnt bool %d", 0 < (ETH_RX_DESC_CNT - stm32_enet->EthHandle.RxDescList.RxBuildDescCnt));
        //         tr_info("state:0x%x", stm32_enet->EthHandle.gState);
                
        //         struct pbuf *pb = NULL;
        //         HAL_StatusTypeDef ret = HAL_ETH_ReadData(&stm32_enet->EthHandle, (void **)&pb);

        //         tr_info("ret:%d error:%d state:0x%x", ret, stm32_enet->EthHandle.ErrorCode, stm32_enet->EthHandle.gState);

        //         //if(HAL_ETH_ReadData(&stm32_enet->EthHandle, (void **)&pb) == HAL_OK)
        //         if(ret == HAL_OK)
        //         {
        //             tr_info("read len:%d next:%d", pb->len, pb->next);

        //             buf = pbuf_alloc(PBUF_RAW, pb->len, PBUF_POOL);
        //             if (buf) 
        //             {
        //                 pbuf_take((struct pbuf *)buf, pb->payload, pb->len);
        //                 stm32_enet->emac_link_input_cb(buf);
        //             }
        //         }



        //     //}
        //}
    }
}


/**
 * This task checks phy link status and updates net status
 */
void STM32_EMAC::phy_task()
{
    const int32_t status = LAN8742_GetLinkState(&LAN8742);
    //const int32_t old_status = (int32_t)phy_status;
    //const int32_t old_status = phy_status;
    const bool is_up  = (status > LAN8742_STATUS_LINK_DOWN);
    //const bool was_up = (old_status > LAN8742_STATUS_LINK_DOWN);
    const bool was_up = (phy_status > LAN8742_STATUS_LINK_DOWN);

    //tr_info("check phy");

    if (is_up && !was_up)
    {
        tr_info("------------------------- connected -------------------------------");
        ETH_MACConfigTypeDef MACConf;
        HAL_ETH_GetMACConfig(&EthHandle, &MACConf);
        switch (status) 
        {
        case LAN8742_STATUS_100MBITS_FULLDUPLEX:
            MACConf.DuplexMode = ETH_FULLDUPLEX_MODE;
            MACConf.Speed = ETH_SPEED_100M;
            break;
        case LAN8742_STATUS_100MBITS_HALFDUPLEX:
            MACConf.DuplexMode = ETH_HALFDUPLEX_MODE;
            MACConf.Speed = ETH_SPEED_100M;
            break;
        case LAN8742_STATUS_10MBITS_FULLDUPLEX:
            MACConf.DuplexMode = ETH_FULLDUPLEX_MODE;
            MACConf.Speed = ETH_SPEED_10M;
            break;
        case LAN8742_STATUS_10MBITS_HALFDUPLEX:
            MACConf.DuplexMode = ETH_HALFDUPLEX_MODE;
            MACConf.Speed = ETH_SPEED_10M;
            break;
        default:
            MACConf.DuplexMode = ETH_FULLDUPLEX_MODE;
            MACConf.Speed = ETH_SPEED_10M;
            break;
        }

        //MACConf.Watchdog = DISABLE;
        //tr_info("watchdog %d", MACConf.Watchdog);
        //tr_info("watchdog time %d", MACConf.WatchdogTimeout);
        HAL_ETH_SetMACConfig(&EthHandle, &MACConf);

        //HAL_ETH_Start_IT(&EthHandle);    
        tr_info("start IT");    
        if(HAL_ETH_Start_IT(&EthHandle) != HAL_OK)
        {
            tr_error("HAL_ETH_Start_IT failed");
        }
        enable_interrupts();

