PA4WD/mbed-os/connectivity/drivers/emac/TARGET_STM/stm32xx_emac_v3.cpp
    return 0;
}

/**
  * @brief  Write a value to a PHY register through the MDIO interface.
  * @param  DevAddr: PHY port address
  * @param  RegAddr: PHY register address
  * @param  RegVal: Value to be written
  * @retval 0 if OK -1 if Error
  */
static int32_t ETH_PHY_IO_WriteReg(uint32_t DevAddr, uint32_t RegAddr, uint32_t RegVal)
{
    STM32_EMAC &emac = STM32_EMAC::get_instance();
    if (HAL_ETH_WritePHYRegister(&emac.EthHandle, DevAddr, RegAddr, RegVal) != HAL_OK) {
        return -1;
    }

    return 0;
}

/**
  * @brief  Get the time in millisecons used for internal PHY driver process.
  * @retval Time value
  */
static int32_t ETH_PHY_IO_GetTick(void)
{
    return HAL_GetTick();
}



/**
  * Ethernet DMA transfer error callbacks
  */
void HAL_ETH_DMAErrorCallback(ETH_HandleTypeDef *heth)
{
    MBED_ERROR(MBED_MAKE_ERROR(MBED_MODULE_DRIVER_ETHERNET, EIO), "Error from ethernet HAL (HAL_ETH_DMAErrorCallback)\n");
}
/**
  * Ethernet MAC transfer error callbacks
  */
void HAL_ETH_MACErrorCallback(ETH_HandleTypeDef *heth)
{
    MBED_ERROR(MBED_MAKE_ERROR(MBED_MODULE_DRIVER_ETHERNET, EIO), "Error from ethernet HAL (HAL_ETH_MACErrorCallback)\n");
}
/**
  * Ethernet error callbacks
  */
void HAL_ETH_ErrorCallback(ETH_HandleTypeDef *heth)
{
    MBED_ASSERT(heth != NULL);

    uint32_t error_code = HAL_ETH_GetError(heth);
    switch (error_code) 
    {
	    case HAL_ETH_ERROR_NONE:
            MBED_ERROR(MBED_MAKE_ERROR(MBED_MODULE_DRIVER_ETHERNET, EIO), "Error from ethernet HAL (HAL_ETH_ErrorCallback) HAL_ETH_ERROR_NONE\n");
            break;
        case HAL_ETH_ERROR_PARAM:
            MBED_ERROR(MBED_MAKE_ERROR(MBED_MODULE_DRIVER_ETHERNET, EIO), "Error from ethernet HAL (HAL_ETH_ErrorCallback) HAL_ETH_ERROR_PARAM\n");
            break;
        case HAL_ETH_ERROR_BUSY:
            MBED_ERROR(MBED_MAKE_ERROR(MBED_MODULE_DRIVER_ETHERNET, EIO), "Error from ethernet HAL (HAL_ETH_ErrorCallback) HAL_ETH_ERROR_BUSY\n");
            break;
        case HAL_ETH_ERROR_TIMEOUT:
            MBED_ERROR(MBED_MAKE_ERROR(MBED_MODULE_DRIVER_ETHERNET, EIO), "Error from ethernet HAL (HAL_ETH_ErrorCallback) HAL_ETH_ERROR_TIMEOUT\n");
            break;
        case HAL_ETH_ERROR_DMA:
        {
            uint32_t dma_error = HAL_ETH_GetDMAError(heth);
            if (dma_error & ETH_DMA_RX_WATCHDOG_TIMEOUT_FLAG)
                MBED_ERROR(MBED_MAKE_ERROR(MBED_MODULE_DRIVER_ETHERNET, EIO), "Error from ethernet HAL (HAL_ETH_ErrorCallback) HAL_ETH_ERROR_DMA ETH_DMA_RX_WATCHDOG_TIMEOUT_FLAG\n");
            else if(dma_error & ETH_DMA_RX_PROCESS_STOPPED_FLAG)
                MBED_ERROR(MBED_MAKE_ERROR(MBED_MODULE_DRIVER_ETHERNET, EIO), "Error from ethernet HAL (HAL_ETH_ErrorCallback) HAL_ETH_ERROR_DMA ETH_DMA_RX_PROCESS_STOPPED_FLAG\n");
            else if(dma_error & ETH_DMA_RX_BUFFER_UNAVAILABLE_FLAG)
                MBED_ERROR(MBED_MAKE_ERROR(MBED_MODULE_DRIVER_ETHERNET, EIO), "Error from ethernet HAL (HAL_ETH_ErrorCallback) HAL_ETH_ERROR_DMA ETH_DMA_RX_BUFFER_UNAVAILABLE_FLAG\n");
            else if(dma_error & ETH_DMA_EARLY_TX_IT_FLAG)
                MBED_ERROR(MBED_MAKE_ERROR(MBED_MODULE_DRIVER_ETHERNET, EIO), "Error from ethernet HAL (HAL_ETH_ErrorCallback) HAL_ETH_ERROR_DMA ETH_DMA_EARLY_TX_IT_FLAG\n");
            else if(dma_error & ETH_DMA_TX_PROCESS_STOPPED_FLAG)
                MBED_ERROR(MBED_MAKE_ERROR(MBED_MODULE_DRIVER_ETHERNET, EIO), "Error from ethernet HAL (HAL_ETH_ErrorCallback) HAL_ETH_ERROR_DMA ETH_DMA_TX_PROCESS_STOPPED_FLAG\n");
            else if(dma_error & ETH_DMA_TX_BUFFER_UNAVAILABLE_IT)
                MBED_ERROR(MBED_MAKE_ERROR(MBED_MODULE_DRIVER_ETHERNET, EIO), "Error from ethernet HAL (HAL_ETH_ErrorCallback) HAL_ETH_ERROR_DMA ETH_DMA_TX_BUFFER_UNAVAILABLE_IT\n");
		   
            MBED_ERROR(MBED_MAKE_ERROR(MBED_MODULE_DRIVER_ETHERNET, EIO), "Error from ethernet HAL (HAL_ETH_ErrorCallback) HAL_ETH_ERROR_DMA\n");
        }
            break;
        case HAL_ETH_ERROR_MAC:
            uint32_t mac_error = HAL_ETH_GetMACError(heth);
            if (mac_error & ETH_RECEIVE_WATCHDOG_TIMEOUT)
                MBED_ERROR(MBED_MAKE_ERROR(MBED_MODULE_DRIVER_ETHERNET, EIO), "Error from ethernet HAL (HAL_ETH_ErrorCallback) HAL_ETH_ERROR_MAC ETH_RECEIVE_WATCHDOG_TIMEOUT\n");
            else if (mac_error & ETH_EXECESSIVE_COLLISIONS)
                MBED_ERROR(MBED_MAKE_ERROR(MBED_MODULE_DRIVER_ETHERNET, EIO), "Error from ethernet HAL (HAL_ETH_ErrorCallback) HAL_ETH_ERROR_MAC ETH_EXECESSIVE_COLLISIONS\n");
            else if (mac_error & ETH_LATE_COLLISIONS)
                MBED_ERROR(MBED_MAKE_ERROR(MBED_MODULE_DRIVER_ETHERNET, EIO), "Error from ethernet HAL (HAL_ETH_ErrorCallback) HAL_ETH_ERROR_MAC ETH_LATE_COLLISIONS\n");
            else if (mac_error & ETH_EXECESSIVE_DEFERRAL)
                MBED_ERROR(MBED_MAKE_ERROR(MBED_MODULE_DRIVER_ETHERNET, EIO), "Error from ethernet HAL (HAL_ETH_ErrorCallback) HAL_ETH_ERROR_MAC ETH_EXECESSIVE_DEFERRAL\n");
            else if (mac_error & ETH_TRANSMIT_JABBR_TIMEOUT)
                MBED_ERROR(MBED_MAKE_ERROR(MBED_MODULE_DRIVER_ETHERNET, EIO), "Error from ethernet HAL (HAL_ETH_ErrorCallback) HAL_ETH_ERROR_MAC ETH_TRANSMIT_JABBR_TIMEOUT\n");
            else if (mac_error & ETH_LOSS_OF_CARRIER)
                MBED_ERROR(MBED_MAKE_ERROR(MBED_MODULE_DRIVER_ETHERNET, EIO), "Error from ethernet HAL (HAL_ETH_ErrorCallback) HAL_ETH_ERROR_MAC ETH_LOSS_OF_CARRIER\n");
            else if (mac_error & ETH_NO_CARRIER)
                MBED_ERROR(MBED_MAKE_ERROR(MBED_MODULE_DRIVER_ETHERNET, EIO), "Error from ethernet HAL (HAL_ETH_ErrorCallback) HAL_ETH_ERROR_MAC ETH_NO_CARRIER\n");

            MBED_ERROR(MBED_MAKE_ERROR(MBED_MODULE_DRIVER_ETHERNET, EIO), "Error from ethernet HAL (HAL_ETH_ErrorCallback) HAL_ETH_ERROR_MAC\n");
            break;
        //case HAL_ETH_ERROR_INVALID_CALLBACK:
            //break;
    }
    MBED_ERROR(MBED_MAKE_ERROR(MBED_MODULE_DRIVER_ETHERNET, error_code), "Error from ethernet HAL (HAL_ETH_ErrorCallback)\n");

	//dev_data->stats.error_details.rx_crc_errors = heth->Instance->MMCRCRCEPR;
	//dev_data->stats.error_details.rx_align_errors = heth->Instance->MMCRAEPR;

}


static bool eth_is_ptp_pkt(struct net_if *iface, struct net_pkt *pkt)
{
    tr_info("eth_is_ptp_pkt");
	// if (ntohs(NET_ETH_HDR(pkt)->type) != NET_ETH_PTYPE_PTP) {
	// 	return false;
	// }

	// net_pkt_set_priority(pkt, NET_PRIORITY_CA);

	return true;
}

void HAL_ETH_TxPtpCallback(uint32_t *buff, ETH_TimeStampTypeDef *timestamp)
{
    tr_info("HAL_ETH_TxPtpCallback");

	// struct eth_stm32_tx_context *ctx = (struct eth_stm32_tx_context *)buff;

	// ctx->pkt->timestamp.second = timestamp->TimeStampHigh;
	// ctx->pkt->timestamp.nanosecond = timestamp->TimeStampLow;

	// net_if_add_tx_timestamp(ctx->pkt);
}






#endif //ETH_IP_VERSION_V3
#endif /* DEVICE_EMAC */